In [33]:
import sqlite3

In [34]:
conn = sqlite3.connect('student.db')
conn

In [35]:
sql = """
 CREATE TABLE student
 ( 
 name text,
 no integer,
 addr text,
 gender text
 )
"""

c = conn.cursor()
c.execute("DROP TABLE IF EXISTS student")
c.execute(sql)
c.close()

In [36]:
sql = """
INSERT INTO student VALUES
 (?, ?, ?, ?)
"""

c = conn.cursor()
c.execute(sql, ("학생2", 2, "안양", "female"))

## 여러개 데이터 넣기
data = [
    ('학생3', 3, '경기도', 'female'),
    ('학생4', 4, '춘천', 'female'),
    ('학생5', 5, '대구', 'male')
]

c.executemany(sql, data)
c.close()
conn.commit()

In [37]:
sql = 'select * from student'
c = conn.cursor()
c.execute(sql)

# 하나의 데이터 확인
print( c.fetchone() )

('학생2', 2, '안양', 'female')

In [38]:
for s in c.fetchmany(10):
    print(s)

('학생3', 3, '경기도', 'female')
('학생4', 4, '춘천', 'female')
('학생5', 5, '대구', 'male')

In [39]:
sql = 'select * from student'
c = conn.cursor()
c.execute(sql)
for s in c.fetchall():
    print(s)

('학생2', 2, '안양', 'female')
('학생3', 3, '경기도', 'female')
('학생4', 4, '춘천', 'female')
('학생5', 5, '대구', 'male')

In [41]:
sql = """
 CREATE TABLE student1
 ( 
 name text,
 no integer,
 addr text,
 gender text
 )
"""

c = conn.cursor()
c.execute("DROP TABLE IF EXISTS student1")
c.execute(sql)
c.close()

In [42]:
sql = """
INSERT INTO student1 VALUES
 (?, ?, ?, ?)
"""

c = conn.cursor()
c.execute(sql, ("학생2", 80, 70, 60))

## 여러개 데이터 넣기
data = [
    ('학생3', 35, 75, 95),
    ('학생4', 54, 95, 54),
    ('학생5', 59, 65, 95),
    ('학생6', 85, 82, 90),
    ('학생7', 53, 95, 50),
    ('학생8', 75, 50, 60),
    ('학생9', 59, 65, 85),
    ('학생10', 85, 55, 75)
]

c.executemany(sql, data)
c.close()
conn.commit()

In [43]:
sql = 'select * from student1'
c = conn.cursor()
c.execute(sql)

# 하나의 데이터 확인
print( c.fetchone() )

('학생2', 80, '70', '60')

In [44]:
for s in c.fetchmany(10):
    print(s)

('학생3', 35, '75', '95')
('학생4', 54, '95', '54')
('학생5', 59, '65', '95')
('학생6', 85, '82', '90')
('학생7', 53, '95', '50')
('학생8', 75, '50', '60')
('학생9', 59, '65', '85')
('학생10', 85, '55', '75')

In [45]:
sql = 'select * from student1'
c = conn.cursor()
c.execute(sql)
for s in c.fetchall():
    print(s)

('학생2', 80, '70', '60')
('학생3', 35, '75', '95')
('학생4', 54, '95', '54')
('학생5', 59, '65', '95')
('학생6', 85, '82', '90')
('학생7', 53, '95', '50')
('학생8', 75, '50', '60')
('학생9', 59, '65', '85')
('학생10', 85, '55', '75')